import { useState } from "react"
import { Col, Nav, Row, Tab, Tabs } from "react-bootstrap"
import Table from 'react-bootstrap/Table';
const HutulburPage = () => {
  const [key, setKey] = useState('Бакалавр')
  const [hutulburs] = useState([
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Эрх зүй /Өдөр/",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 6,
      "shalguuriin_turul": "1",
      "shalgalt": "Англи хэл"
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Эрх зүй /Өдөр/",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 6,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Эрх зүй /Эчнээ/",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 7,
      "shalguuriin_turul": "2",
      "shalgalt": "Их дээд сургууль бакалаврын зэрэгтэй төгссөн байх"
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Магистрын сургалт",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 8,
      "shalguuriin_turul": "2",
      "shalgalt": "Эрх зүйн бакалаврын зэрэгтэй байх"
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Докторын сургалт",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 9,
      "shalguuriin_turul": "2",
      "shalgalt": "Эрх зүйн бакалаврын зэрэгтэй байх"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Эдийн засаг",
      "m_name": "Гааль татварын эдийн засаг",
      "mergeshil": "Олон чиглэлийн эдийн засаг, Эрсдэлийн шинжээч, Эдийн засгийн багш, Эдийн засгийн статистик, Төсөл төслийн үнэлгээ, Олон улсын экономикс гэх мэт ",
      "bosgo_onoo": 480,
      "MergejilId": 12,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Эдийн засаг",
      "m_name": "Гааль татварын эдийн засаг",
      "mergeshil": "Олон чиглэлийн эдийн засаг, Эрсдэлийн шинжээч, Эдийн засгийн багш, Эдийн засгийн статистик, Төсөл төслийн үнэлгээ, Олон улсын экономикс гэх мэт ",
      "bosgo_onoo": 480,
      "MergejilId": 12,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Нягтлан бодох бүртгэл",
      "m_name": "Нягтлан бодох бүртгэл",
      "mergeshil": "Санхүүгийн албаны дарга, ерөнхий нягтлан бодогч, ахлах нягтлан бодогч, тооцооны нягтлан бодогч, банк, банк бус, аж ахуйн нэгж байгууллагад дотоод аудитор өртгийн удирдлага, төлөвлөлт, төсөвлөлтийн болон татварын нягтлан бодогч, татварын зөвлөх компаниудад татварын зөвлөх",
      "bosgo_onoo": 480,
      "MergejilId": 14,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Нягтлан бодох бүртгэл",
      "m_name": "Нягтлан бодох бүртгэл",
      "mergeshil": "Санхүүгийн албаны дарга, ерөнхий нягтлан бодогч, ахлах нягтлан бодогч, тооцооны нягтлан бодогч, банк, банк бус, аж ахуйн нэгж байгууллагад дотоод аудитор өртгийн удирдлага, төлөвлөлт, төсөвлөлтийн болон татварын нягтлан бодогч, татварын зөвлөх компаниудад татварын зөвлөх",
      "bosgo_onoo": 480,
      "MergejilId": 14,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Нягтлан бодох бүртгэл",
      "m_name": "Нягтлан бодох бүртгэл /эчнээ 2.5 жил/",
      "mergeshil": "Санхүүгийн албаны дарга, ерөнхий нягтлан бодогч, ахлах нягтлан бодогч, тооцооны нягтлан бодогч, банк, банк бус, аж ахуйн нэгж байгууллагад дотоод аудитор өртгийн удирдлага, төлөвлөлт, төсөвлөлтийн болон татварын нягтлан бодогч, татварын зөвлөх компаниудад татварын зөвлөх",
      "bosgo_onoo": 480,
      "MergejilId": 15,
      "shalguuriin_turul": "2",
      "shalgalt": "Их дээд сургууль бакалаврын зэрэгтэй төгссөн байх"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Банк",
      "m_name": "Банкны эдийн засаг",
      "mergeshil": "Санхүүгийн шинжээч, судлаач, хөрөнгө зохицуулалтын менежер, хөрөнгийн шинжээч, дилер, зээлийн эрсдэлийн шинжээч, барьцаа хөрөнгийн үнэлгээний менежер, гадаад худалдааны санхүүжилтын хэлсэст мэргэжилтэн, хөрөнгө оруулалтын банкинд дилер, хөрөнгө зохицуулалтын менежер",
      "bosgo_onoo": 480,
      "MergejilId": 16,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Банк",
      "m_name": "Банкны эдийн засаг",
      "mergeshil": "Санхүүгийн шинжээч, судлаач, хөрөнгө зохицуулалтын менежер, хөрөнгийн шинжээч, дилер, зээлийн эрсдэлийн шинжээч, барьцаа хөрөнгийн үнэлгээний менежер, гадаад худалдааны санхүүжилтын хэлсэст мэргэжилтэн, хөрөнгө оруулалтын банкинд дилер, хөрөнгө зохицуулалтын менежер",
      "bosgo_onoo": 480,
      "MergejilId": 16,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Банк",
      "m_name": "Банкны менежмент",
      "mergeshil": "Банкны эдийн засаг, нябо, теллер, ахлах теллер, аудитор, ахлах аудитор, хянан шалгагч, зах зээлийн эрсдлийн шинжээч, хөрөнгийн шинжээч, дилер, эдийн засагч, зээлийн эдийн засагч, зээлийн эрсдлийн шинжээч, дилер хөрөнгө оруулалтын менежер",
      "bosgo_onoo": 480,
      "MergejilId": 17,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Банк",
      "m_name": "Банкны менежмент",
      "mergeshil": "Банкны эдийн засаг, нябо, теллер, ахлах теллер, аудитор, ахлах аудитор, хянан шалгагч, зах зээлийн эрсдлийн шинжээч, хөрөнгийн шинжээч, дилер, эдийн засагч, зээлийн эдийн засагч, зээлийн эрсдлийн шинжээч, дилер хөрөнгө оруулалтын менежер",
      "bosgo_onoo": 480,
      "MergejilId": 17,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Санхүү",
      "m_name": "Санхүүгийн менежмент",
      "mergeshil": "Санхүүгийн менежер, санхүүгийн шинжээч, даатгалын зуучлагч, хөрөнгийн үнэлгээчин, хөрөнгө оруулалтын менежер, валют арилжааны дилер, хянан шалгагч, эрсдэлийн шинжээч",
      "bosgo_onoo": 480,
      "MergejilId": 18,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Санхүү",
      "m_name": "Санхүүгийн менежмент",
      "mergeshil": "Санхүүгийн менежер, санхүүгийн шинжээч, даатгалын зуучлагч, хөрөнгийн үнэлгээчин, хөрөнгө оруулалтын менежер, валют арилжааны дилер, хянан шалгагч, эрсдэлийн шинжээч",
      "bosgo_onoo": 480,
      "MergejilId": 18,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Бизнесийн удирдлага",
      "m_name": "Бизнесийн удирдлага",
      "mergeshil": "Төслийн менежер, мэргэжилтэн, стратеги төлөвлөлтийн мэргэжилтэн, байгууллагын бүх шатны менежер, мэргэжилтэн, бизнесийн зөвлөх, үндсэн үйл ажиллагааны менежер, мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 19,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Бизнесийн удирдлага",
      "m_name": "Бизнесийн удирдлага",
      "mergeshil": "Төслийн менежер, мэргэжилтэн, стратеги төлөвлөлтийн мэргэжилтэн, байгууллагын бүх шатны менежер, мэргэжилтэн, бизнесийн зөвлөх, үндсэн үйл ажиллагааны менежер, мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 19,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Бизнесийн удирдлага",
      "m_name": "Бизнесийн удирдлага /Магистр 1.5 жил/",
      "mergeshil": "Төслийн менежер, мэргэжилтэн, стратеги төлөвлөлтийн мэргэжилтэн, байгууллагын бүх шатны менежер, мэргэжилтэн, бизнесийн зөвлөх, үндсэн үйл ажиллагааны менежер, мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 21,
      "shalguuriin_turul": "2",
      "shalgalt": "Их дээд сургууль бакалаврын зэрэгтэй төгссөн байх"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Худалдаа",
      "m_name": "Гадаад худалдаа гаалийн менежмент",
      "mergeshil": "Элчин сайдын яамны худалдааны атташе, олон улсын байгууллагын худалдааны ажилтан, дэлгүүр худалдааны байгууллагуудын худалдааны мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 22,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Худалдаа",
      "m_name": "Гадаад худалдаа гаалийн менежмент",
      "mergeshil": "Элчин сайдын яамны худалдааны атташе, олон улсын байгууллагын худалдааны ажилтан, дэлгүүр худалдааны байгууллагуудын худалдааны мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 22,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Худалдаа",
      "m_name": "Олон улсын худалдаа эдийн засаг",
      "mergeshil": "Элчин сайдын яамны худалдааны атташе, олон улсын байгууллагын худалдааны ажилтан, дэлгүүр худалдааны байгууллагуудын худалдааны мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 23,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Худалдаа",
      "m_name": "Олон улсын худалдаа эдийн засаг",
      "mergeshil": "Элчин сайдын яамны худалдааны атташе, олон улсын байгууллагын худалдааны ажилтан, дэлгүүр худалдааны байгууллагуудын худалдааны мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 23,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Эрх зүй",
      "m_name": "Олон улсын эрх зүй",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 24,
      "shalguuriin_turul": "1",
      "shalgalt": "Нийгмийн тухай мэдлэг"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Эрх зүй",
      "m_name": "Олон улсын эрх зүй",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 24,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Аюулгүй байдал-хууль сахиулах",
      "m_name": "Аюулгүй байдал-хууль сахиулах",
      "mergeshil": "Цагдаагийн байгууллага, ШШГЕГ, ОБЕГ, Төрийн тусгай хамгаалалтын газар, Хилийн алба, Нисэх гаалийн шалган, нэвтрүүлэх алба, ААНБ-д аюулгүй байдлын ажилтан гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 25,
      "shalguuriin_turul": "1",
      "shalgalt": "Нийгмийн тухай мэдлэг"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Аюулгүй байдал-хууль сахиулах",
      "m_name": "Аюулгүй байдал-хууль сахиулах",
      "mergeshil": "Цагдаагийн байгууллага, ШШГЕГ, ОБЕГ, Төрийн тусгай хамгаалалтын газар, Хилийн алба, Нисэх гаалийн шалган, нэвтрүүлэх алба, ААНБ-д аюулгүй байдлын ажилтан гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 25,
      "shalguuriin_turul": "2",
      "shalgalt": "Ур чадвар"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Олон улсын харилцаа",
      "m_name": "Гадаад харилцааны ажилтан",
      "mergeshil": "Дипломатч, элчин сайдын яамны ажилтан, олон улсын байгууллагын ажилтан, төрийн болон төрийн бус байгууллагын гадаад харилцааны салбар хэлтэст мэргэжилтэн, ахлах, дарга, зөвлөх, олон улсын харилцааны багш, гадаад улс оронтой хамтын ажиллагаатай хувийн пүүс, компанид гадаад харилцааны ажилтан, менежер, ахлагч, зөвлөх дарга",
      "bosgo_onoo": 480,
      "MergejilId": 26,
      "shalguuriin_turul": "1",
      "shalgalt": "Нийгмийн тухай мэдлэг"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Олон улсын харилцаа",
      "m_name": "Гадаад харилцааны ажилтан",
      "mergeshil": "Дипломатч, элчин сайдын яамны ажилтан, олон улсын байгууллагын ажилтан, төрийн болон төрийн бус байгууллагын гадаад харилцааны салбар хэлтэст мэргэжилтэн, ахлах, дарга, зөвлөх, олон улсын харилцааны багш, гадаад улс оронтой хамтын ажиллагаатай хувийн пүүс, компанид гадаад харилцааны ажилтан, менежер, ахлагч, зөвлөх дарга",
      "bosgo_onoo": 480,
      "MergejilId": 26,
      "shalguuriin_turul": "2",
      "shalgalt": "Физик"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Эрх зүй /Их Засаг Хууль зүйн сургуулийн салбар/",
      "m_name": "Эрх зүй /Их Засаг Хууль зүйн сургуулийн салбар/",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 27,
      "shalguuriin_turul": "1",
      "shalgalt": "Нийгмийн тухай мэдлэг"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Эрх зүй /Их Засаг Хууль зүйн сургуулийн салбар/",
      "m_name": "Эрх зүй /Их Засаг Хууль зүйн сургуулийн салбар/",
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 27,
      "shalguuriin_turul": "2",
      "shalgalt": "Англи хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Барилгын инженер",
      "m_name": "Иргэний ба үйлдвэрийн барилгын инженер",
      "mergeshil": "Барилгын үйлдвэрлэлийн салбарт барилгын инженер, барилгын захиалагч, зураг төслийн салбарт зураг төслийн инженер, эрдэм шинжилгээ, хяналтын байгууллагын ажилтан, судлаач инженер, эрдэм шинжилгээний ажилтан, барилгын компаны ерөнхий инженер, талбайн инженер гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 28,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Барилгын инженер",
      "m_name": "Иргэний ба үйлдвэрийн барилгын инженер",
      "mergeshil": "Барилгын үйлдвэрлэлийн салбарт барилгын инженер, барилгын захиалагч, зураг төслийн салбарт зураг төслийн инженер, эрдэм шинжилгээ, хяналтын байгууллагын ажилтан, судлаач инженер, эрдэм шинжилгээний ажилтан, барилгын компаны ерөнхий инженер, талбайн инженер гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 28,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Барилгын инженер",
      "m_name": "Авто замын барилгын инженер",
      "mergeshil": "Барилгын үйлдвэрлэлийн салбарт барилгын инженер, барилгын захиалагч, зураг төслийн салбарт зураг төслийн инженер, эрдэм шинжилгээ, хяналтын байгууллагын ажилтан, судлаач инженер, эрдэм шинжилгээний ажилтан, барилгын компаны ерөнхий инженер, талбайн инженер гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 29,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Барилгын инженер",
      "m_name": "Авто замын барилгын инженер",
      "mergeshil": "Барилгын үйлдвэрлэлийн салбарт барилгын инженер, барилгын захиалагч, зураг төслийн салбарт зураг төслийн инженер, эрдэм шинжилгээ, хяналтын байгууллагын ажилтан, судлаач инженер, эрдэм шинжилгээний ажилтан, барилгын компаны ерөнхий инженер, талбайн инженер гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 29,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Дулааны инженер",
      "m_name": "Дулааны инженер",
      "mergeshil": "Дулааны тоног төхөөрөмжийн инженер, дулааны процессын автоматжуулалын инженер, халаалтын системийн инженер, цурын турбин, уурын генераторын ашиглалтын инженер, дулааны цахилгаан станцын горимын инженер, дулааны цахилгааны станцын зураг төслийн инженер, хяналтын инженер, дулааны цахилгаан станцын туршилт, тохируулгын инженер",
      "bosgo_onoo": 480,
      "MergejilId": 30,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Дулааны инженер",
      "m_name": "Дулааны инженер",
      "mergeshil": "Дулааны тоног төхөөрөмжийн инженер, дулааны процессын автоматжуулалын инженер, халаалтын системийн инженер, цурын турбин, уурын генераторын ашиглалтын инженер, дулааны цахилгаан станцын горимын инженер, дулааны цахилгааны станцын зураг төслийн инженер, хяналтын инженер, дулааны цахилгаан станцын туршилт, тохируулгын инженер",
      "bosgo_onoo": 480,
      "MergejilId": 30,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Цахилгааны инженер",
      "m_name": "Цахилгааны инженер",
      "mergeshil": "Эрчим хүчний үйлдвэр, албан газруудад цахилгааны инженер, ЦС, ДС-ын тоног төхөөрөмжийн угсралт суурилалтын инженер, цахилгаан эрчим хүчний байгууллагын хэмнэлтийн инженер, засвар үйлчилгээ, туршилт тохируулгын инженер, диспетчерийн үндэсний төвд диспетчер инженер, гадаад дотоодын байгууллагын төсөл хэрэгжүүлэгч байгууллагын мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 31,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Цахилгааны инженер",
      "m_name": "Цахилгааны инженер",
      "mergeshil": "Эрчим хүчний үйлдвэр, албан газруудад цахилгааны инженер, ЦС, ДС-ын тоног төхөөрөмжийн угсралт суурилалтын инженер, цахилгаан эрчим хүчний байгууллагын хэмнэлтийн инженер, засвар үйлчилгээ, туршилт тохируулгын инженер, диспетчерийн үндэсний төвд диспетчер инженер, гадаад дотоодын байгууллагын төсөл хэрэгжүүлэгч байгууллагын мэргэжилтэн гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 31,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Компьютерийн программ хангамж",
      "m_name": "Компьютерийн программ хангамж",
      "mergeshil": "Программист, Харилцаа холбооны компаниудад программист, /Мобиком, Юнитель, Скайтель, Жи-мобайл, Цахилгаан холбоо/ гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 32,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Компьютерийн программ хангамж",
      "m_name": "Компьютерийн программ хангамж",
      "mergeshil": "Программист, Харилцаа холбооны компаниудад программист, /Мобиком, Юнитель, Скайтель, Жи-мобайл, Цахилгаан холбоо/ гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 32,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Зочлох үйлчилгээ",
      "m_name": "Зочид буудал зоогийн газрын менежмент",
      "mergeshil": "Зочлох үйлчилгээний байгууллагын бүх шатны менежер, дарга гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 33,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Аялал жуулчлал",
      "m_name": "Аялал жуулчлалын менежмент",
      "mergeshil": "Олон улсын аялал жуулчлалын байгууллагын менежер, дарга гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 34,
      "shalguuriin_turul": "1",
      "shalgalt": "Математик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Аялал жуулчлал",
      "m_name": "Аялал жуулчлалын менежмент",
      "mergeshil": "Олон улсын аялал жуулчлалын байгууллагын менежер, дарга гэх мэт",
      "bosgo_onoo": 480,
      "MergejilId": 34,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Ерөнхий мэргэжлийн анагаах ухаан /Хүний их эмч/",
      "m_name": "Их эмч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 35,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Ерөнхий мэргэжлийн анагаах ухаан /Хүний их эмч/",
      "m_name": "Их эмч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 35,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Уламжлалт анагаах ухаан /Уламжлалт анагаахын их эмч/",
      "m_name": "Улалмжлалтын их эмч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 36,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Уламжлалт анагаах ухаан /Уламжлалт анагаахын их эмч/",
      "m_name": "Улалмжлалтын их эмч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 36,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Сувилахуй",
      "m_name": "Сувилагч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 37,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Сувилахуй",
      "m_name": "Сувилагч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 37,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Нийгмийн эрүүл мэнд",
      "m_name": "Нийгмийн эрүүл мэнд судлаач",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 38,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Нийгмийн эрүүл мэнд",
      "m_name": "Нийгмийн эрүүл мэнд судлаач",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 38,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Эм зүй",
      "m_name": "Эм зүйч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 39,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Эм зүй",
      "m_name": "Эм зүйч",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 39,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Шүдний их эмч",
      "m_name": "Шүд, нүүр,ам судлал",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 40,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Шүдний их эмч",
      "m_name": "Шүд, нүүр,ам судлал",
      "mergeshil": "",
      "bosgo_onoo": 480,
      "MergejilId": 40,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Сэтгүүл зүй",
      "m_name": "Сэтгүүлч",
      "mergeshil": "Телевизийн сэтгүүлч, сонины сэтгүүлч, FM радиогоор сэтгүүлч, олон улсын сэтгүүлч",
      "bosgo_onoo": 480,
      "MergejilId": 41,
      "shalguuriin_turul": "1",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Сэтгүүл зүй",
      "m_name": "Сэтгүүлч",
      "mergeshil": "Телевизийн сэтгүүлч, сонины сэтгүүлч, FM радиогоор сэтгүүлч, олон улсын сэтгүүлч",
      "bosgo_onoo": 480,
      "MergejilId": 41,
      "shalguuriin_turul": "2",
      "shalgalt": "Ур чадвар"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Жүжиглэх урлаг",
      "m_name": "Жүжигчин",
      "mergeshil": "Театрын жүжигчин, киноны жүжигчин, радио телевизийн жүжигчин",
      "bosgo_onoo": 480,
      "MergejilId": 42,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Жүжиглэх урлаг",
      "m_name": "Жүжигчин",
      "mergeshil": "Театрын жүжигчин, киноны жүжигчин, радио телевизийн жүжигчин",
      "bosgo_onoo": 480,
      "MergejilId": 42,
      "shalguuriin_turul": "2",
      "shalgalt": "Ур чадвар"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Зураг авалт",
      "m_name": "Кино телевиз, хэвлэлийн зураг авалт /Оператор/",
      "mergeshil": "Киноны зураглаач, телевизийн зураглаач, хэвлэлийн зураглаач",
      "bosgo_onoo": 480,
      "MergejilId": 44,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Зураг авалт",
      "m_name": "Кино телевиз, хэвлэлийн зураг авалт /Оператор/",
      "mergeshil": "Киноны зураглаач, телевизийн зураглаач, хэвлэлийн зураглаач",
      "bosgo_onoo": 480,
      "MergejilId": 44,
      "shalguuriin_turul": "2",
      "shalgalt": "Ур чадвар"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Найруулах урлаг",
      "m_name": "Найруулагч",
      "mergeshil": "Театрын найруулагч, киноны найруулагч, радио телевизийн найруулагч",
      "bosgo_onoo": 480,
      "MergejilId": 45,
      "shalguuriin_turul": "1",
      "shalgalt": "Хими"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Найруулах урлаг",
      "m_name": "Найруулагч",
      "mergeshil": "Театрын найруулагч, киноны найруулагч, радио телевизийн найруулагч",
      "bosgo_onoo": 480,
      "MergejilId": 45,
      "shalguuriin_turul": "2",
      "shalgalt": "Ур чадвар"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Багш, Сургуулийн өмнөх боловсролын",
      "m_name": "Багш, сургуулийн өмнөх боловсрол",
      "mergeshil": "Сургуулийн өмнөх боловсролын багш, цэцэрлэгийн багш",
      "bosgo_onoo": 480,
      "MergejilId": 46,
      "shalguuriin_turul": "1",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Багш, Сургуулийн өмнөх боловсролын",
      "m_name": "Багш, сургуулийн өмнөх боловсрол",
      "mergeshil": "Сургуулийн өмнөх боловсролын багш, цэцэрлэгийн багш",
      "bosgo_onoo": 480,
      "MergejilId": 46,
      "shalguuriin_turul": "2",
      "shalgalt": "Хими"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Багш, бага ангийн",
      "m_name": "Багш, бага ангийн",
      "mergeshil": "Бага ангийн багш",
      "bosgo_onoo": 480,
      "MergejilId": 47,
      "shalguuriin_turul": "1",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Багш, бага ангийн",
      "m_name": "Багш, бага ангийн",
      "mergeshil": "Бага ангийн багш",
      "bosgo_onoo": 480,
      "MergejilId": 47,
      "shalguuriin_turul": "2",
      "shalgalt": "Хими"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Сэтгэл судлал",
      "m_name": "Сэтгэл судлал",
      "mergeshil": "Сэтгэл судлал",
      "bosgo_onoo": 480,
      "MergejilId": 48,
      "shalguuriin_turul": "1",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Сэтгэл судлал",
      "m_name": "Сэтгэл судлал",
      "mergeshil": "Сэтгэл судлал",
      "bosgo_onoo": 480,
      "MergejilId": 48,
      "shalguuriin_turul": "2",
      "shalgalt": "Хими"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Онгоцны үйлчлэгч",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 49,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Онгоцны нисгэгч",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 50,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Онгоцны засварын инженер",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 51,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Удирдлагатай онгоцны инженер",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 52,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Маркетинг",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 53,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Банк санхүү",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 54,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Нийгмийн халамж",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 55,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Хэвлэл мэдээлэл, зар суртачилгааны ажилтан",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 56,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Зочид буудал зоогийн газрын үйлчилгээний ажилтан",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 57,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Зочид буудал аялал жуулчлалын маркетинг",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 58,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Тусгай хэрэгцээт боловсролын багш /бага, дунд/",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 59,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Шинжлэх ухаан технологи",
      "m_name": "Агаарын IT /агаарын тээврийн IT/",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 60,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Шинжлэх ухаан технологи",
      "m_name": "Цахилгаан техник, IT",
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "bosgo_onoo": 480,
      "MergejilId": 61,
      "shalguuriin_turul": "2",
      "shalgalt": "Монгол хэл"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Хэвлэлийн график дизайнч",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 63,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Нарийн бичгийн дарга албан хэргийн ажилтан",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 64,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Барилгын засал чимэглэгч",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 65,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Хувцас дизайн",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 66,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Үсчин",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 67,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Гоо засалч",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 68,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Зочид буудал, зоогийн газрын үйлчилгээний ажилтан",
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 69,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Агаарын хөлгийн үйлчилгээний ажилтан",
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 70,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Нягтлан бодох, бүртгэл тооцооны ажилтан",
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 71,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Нярав төлбөр тооцооны ажилтан /цалин хөлсний /",
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 72,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Үсчин",
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 73,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Тогооч",
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 74,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана"
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Гоо засалч",
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "bosgo_onoo": 480,
      "MergejilId": 75,
      "shalguuriin_turul": "2",
      "shalgalt": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана"
    }
  ])
  return (
    <div>
      <div className="container">
        <Tab.Container id="left-tabs-example" className="container">
          {/* Tab  */}

          <Tabs
            defaultActiveKey="Бакалавр"
            id="justify-tab-example"
            className="mb-3 "
            justify
            activeKey={key}
            onSelect={(k) => setKey(k)}
          >
            <Tab eventKey="Магистр" title="Магистр" className="text-light" />
            <Tab eventKey="Бакалавр" title="Бакалавр" />
            <Tab eventKey="2 + 2" title="2 + 2" />
            <Tab eventKey="Эчнээ" title="Эчнээ" />
          </Tabs>
        </Tab.Container>


      </div>
      <div>
        <Table striped bordered hover size="sm" responsive >
          <thead>
            <tr>

              {/* {Ectx.state.burtgel_Id && Ectx.state.email && 
              ( */}
              <th ></th>
              {/* )
              }  */}
              <th className="lead fs-5 text-center">Сургуулийн нэр</th>
              <th className="lead fs-5 text-center">Хөтөлбөрийн нэр</th>
              <th className="lead fs-5 text-center">Мэргэжил</th>
              <th className="lead fs-5 text-center">Мэргэшил</th>
              <th className="lead fs-5 text-center">Босго оноо</th>
              <th className="lead fs-5 text-center">Шалгуур 1</th>
              <th className="lead fs-5 text-center">Шалгуур 2</th>
            </tr>
          </thead>
          <tbody>
            {hutulburs && hutulburs.map(function (e, index, array) {
              let sh2;
              if (e.MergejilId == 8 || e.MergejilId == 9) {
                return (
                  <tr key={e.MergejilId}>
                    {/* {Ectx.state.burtgel_Id && Ectx.state.email &&
                      ( */}
                    <td className="lead fs-5">
                      <button className='btn btn-primary' onClick={() => { }}>
                        Сонгох
                      </button>
                    </td>
                    {/* )
                    } */}
                    <td className="lead fs-5">
                      <a href={e.mlink ? e.mlink : e.link} target="_blank">{e.s_name} </a></td>
                    <td className="lead fs-5">{e.h_name}</td>
                    <td className="lead fs-5">{e.m_name}</td>
                    <td>
                      <div className=" lead fs-5">{e.mergeshil}</div>
                    </td>
                    <td className="lead fs-5">{e.bosgo_onoo}</td>
                    <td className="lead fs-5">{e.shalgalt}</td>
                    <td className="lead fs-5">{sh2}</td>
                  </tr>
                );
              }


              if (e.MergejilId == 7 || e.MergejilId == 15) {
                return (
                  <tr key={e.MergejilId}>
                    {/* {Ectx.state.burtgel_Id && Ectx.state.email &&
                      ( */}
                    <td className="lead fs-5">
                      <button className='btn btn-primary' onClick={() => { }}>
                        Сонгох
                      </button>
                    </td>
                    {/* )
                    } */}
                    <td className="lead fs-5">
                      <a href={e.mlink ? e.mlink : e.link} target="_blank">{e.s_name} </a></td>
                    <td className="lead fs-5">{e.h_name}</td>
                    <td className="lead fs-5">{e.m_name}</td>
                    <td>
                      <div className=" lead fs-5">{e.mergeshil}</div>
                    </td>
                    <td className="lead fs-5"></td>
                    <td className="lead fs-5"></td>
                    <td className="lead fs-5"></td>
                  </tr>
                );
              }
              if (
                index < hutulburs.length &&
                array[++index]?.MergejilId === e.MergejilId
              ) {
                sh2 = array[index]?.shalgalt;
              } else if (array[index - 2]?.MergejilId === e.MergejilId) {
                return;
              }
              return (
                <tr key={e.MergejilId}>
                  {/* {Ectx.state.burtgel_Id && Ectx.state.email &&
                    ( */}
                  <td className="lead fs-5">
                    <button className='btn btn-primary' onClick={() => { }}>
                      Сонгох
                    </button>
                  </td>
                  {/* )
                  } */}
                  <td className="lead fs-5">
                    <a href={e.mlink ? e.mlink : e.link} target="_blank">{e.s_name} </a></td>
                  <td className="lead fs-5">{e.h_name}</td>
                  <td className="lead fs-5">{e.m_name}</td>
                  <td>
                    <div className="lead fs-5">{e.mergeshil}</div>
                  </td>
                  <td className="lead fs-5">{e.bosgo_onoo}</td>
                  <td className="lead fs-5">{e.shalgalt}</td>
                  <td className="lead fs-5">{sh2}</td>
                </tr>
              );
            })
            }

            {/* 
            {hutulburs.map(hutulbur => {
              return (
                <tr key={hutulbur.MergejilId}>
                  <td className="text-center"><button className='btn btn-primary' onClick={() => { }}>
                    Сонгох
                  </button></td>
                  <td className="text-center">{hutulbur.s_name}</td>
                  <td className="text-center">{hutulbur.h_name}</td>
                  <td className="text-center">{hutulbur.m_name}</td>
                  <td className="text-center">{hutulbur.mergeshil}</td>
                  <td className="text-center">{hutulbur.shalgalt}</td>
                  <td className="text-center">{hutulbur.bosgo_onoo}</td>
                  <td className="text-center">{hutulbur.shalgalt}</td>
                </tr>
              )
            })} */}

          </tbody>
        </Table>
        {/* table */}

        {/* table head */}
        {/* tbody */}
      </div>


    </div>
  )
}

export default HutulburPage