import { useState, useContext } from "react"
import { Tab, Tabs, Table } from "react-bootstrap"
import { toast } from 'react-toastify'
import { InputGroup, FormControl } from 'react-bootstrap';
import { useLocation } from "react-router-dom";
import ElsegchContext from "../../context/ElsegchContext";
const HutulburPage = () => {
  let FilteredHutulbur = [];
  const Ectx = useContext(ElsegchContext)
  const location = useLocation();
  const [hutulburs] = useState([
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Эрх зүй /Өдөр/",
      "bosgo_onoo": 480,
      "MergejilId": 6,
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Хими, Биологи, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Англи хэл, Монгол хэл, Математик, Нийгмийн тухай мэдлэг"
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Эрх зүй /Эчнээ/",
      "bosgo_onoo": 480,
      "MergejilId": 7,
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "shalgalt_2": "Их дээд сургууль бакалаврын зэрэгтэй төгссөн байх",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Магистрын сургалт",
      "bosgo_onoo": 480,
      "MergejilId": 8,
      "mergeshil": "",
      "shalgalt_2": "Эрх зүйн бакалаврын зэрэгтэй байх",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ ХУУЛЬ ЗҮЙН СУРГУУЛЬ",
      "h_name": "Эрх зүй",
      "m_name": "Докторын сургалт",
      "bosgo_onoo": 480,
      "MergejilId": 9,
      "mergeshil": "",
      "shalgalt_2": "Эрх зүйн бакалаврын зэрэгтэй байх",
      "shalgalt_1": null
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Эдийн засаг",
      "m_name": "Гааль татварын эдийн засаг",
      "bosgo_onoo": 480,
      "MergejilId": 12,
      "mergeshil": "Олон чиглэлийн эдийн засаг, Эрсдэлийн шинжээч, Эдийн засгийн багш, Эдийн засгийн статистик, Төсөл төслийн үнэлгээ, Олон улсын экономикс гэх мэт ",
      "shalgalt_2": "Монгол хэл, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Нийгмийн тухай мэдлэг, Монгол хэл, Физик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Нягтлан бодох бүртгэл",
      "m_name": "Нягтлан бодох бүртгэл",
      "bosgo_onoo": 480,
      "MergejilId": 14,
      "mergeshil": "Санхүүгийн албаны дарга, ерөнхий нягтлан бодогч, ахлах нягтлан бодогч, тооцооны нягтлан бодогч, банк, банк бус, аж ахуйн нэгж байгууллагад дотоод аудитор өртгийн удирдлага, төлөвлөлт, төсөвлөлтийн болон татварын нягтлан бодогч, татварын зөвлөх компаниудад татварын зөвлөх",
      "shalgalt_2": "Монгол хэл, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Монгол хэл, Нийгмийн тухай мэдлэг, Физик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Нягтлан бодох бүртгэл",
      "m_name": "Нягтлан бодох бүртгэл /эчнээ 2.5 жил/",
      "bosgo_onoo": 480,
      "MergejilId": 15,
      "mergeshil": "Санхүүгийн албаны дарга, ерөнхий нягтлан бодогч, ахлах нягтлан бодогч, тооцооны нягтлан бодогч, банк, банк бус, аж ахуйн нэгж байгууллагад дотоод аудитор өртгийн удирдлага, төлөвлөлт, төсөвлөлтийн болон татварын нягтлан бодогч, татварын зөвлөх компаниудад татварын зөвлөх",
      "shalgalt_2": "Их дээд сургууль бакалаврын зэрэгтэй төгссөн байх",
      "shalgalt_1": null
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Банк",
      "m_name": "Банкны эдийн засаг",
      "bosgo_onoo": 480,
      "MergejilId": 16,
      "mergeshil": "Санхүүгийн шинжээч, судлаач, хөрөнгө зохицуулалтын менежер, хөрөнгийн шинжээч, дилер, зээлийн эрсдэлийн шинжээч, барьцаа хөрөнгийн үнэлгээний менежер, гадаад худалдааны санхүүжилтын хэлсэст мэргэжилтэн, хөрөнгө оруулалтын банкинд дилер, хөрөнгө зохицуулалтын менежер",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Монгол хэл, Нийгмийн тухай мэдлэг, Физик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Санхүү",
      "m_name": "Санхүүгийн менежмент",
      "bosgo_onoo": 480,
      "MergejilId": 18,
      "mergeshil": "Санхүүгийн менежер, санхүүгийн шинжээч, даатгалын зуучлагч, хөрөнгийн үнэлгээчин, хөрөнгө оруулалтын менежер, валют арилжааны дилер, хянан шалгагч, эрсдэлийн шинжээч",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Бизнесийн удирдлага",
      "m_name": "Бизнесийн удирдлага",
      "bosgo_onoo": 480,
      "MergejilId": 19,
      "mergeshil": "Төслийн менежер, мэргэжилтэн, стратеги төлөвлөлтийн мэргэжилтэн, байгууллагын бүх шатны менежер, мэргэжилтэн, бизнесийн зөвлөх, үндсэн үйл ажиллагааны менежер, мэргэжилтэн гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Нийгмийн тухай мэдлэг, Монгол хэл, Физик"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Бизнесийн удирдлага",
      "m_name": "Бизнесийн удирдлага /Магистр 1.5 жил/",
      "bosgo_onoo": 480,
      "MergejilId": 21,
      "mergeshil": "Төслийн менежер, мэргэжилтэн, стратеги төлөвлөлтийн мэргэжилтэн, байгууллагын бүх шатны менежер, мэргэжилтэн, бизнесийн зөвлөх, үндсэн үйл ажиллагааны менежер, мэргэжилтэн гэх мэт",
      "shalgalt_2": "Их дээд сургууль бакалаврын зэрэгтэй төгссөн байх",
      "shalgalt_1": null
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Банк",
      "m_name": "Банкны менежмент",
      "bosgo_onoo": 480,
      "MergejilId": 17,
      "mergeshil": "Банкны эдийн засаг, нябо, теллер, ахлах теллер, аудитор, ахлах аудитор, хянан шалгагч, зах зээлийн эрсдлийн шинжээч, хөрөнгийн шинжээч, дилер, эдийн засагч, зээлийн эдийн засагч, зээлийн эрсдлийн шинжээч, дилер хөрөнгө оруулалтын менежер",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Монгол хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Худалдаа",
      "m_name": "Гадаад худалдаа гаалийн менежмент",
      "bosgo_onoo": 480,
      "MergejilId": 22,
      "mergeshil": "Элчин сайдын яамны худалдааны атташе, олон улсын байгууллагын худалдааны ажилтан, дэлгүүр худалдааны байгууллагуудын худалдааны мэргэжилтэн гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Газарзүй, Биологи, Монголын түүх",
      "shalgalt_1": "Математик, Нийгмийн тухай мэдлэг, Физик, Англи хэл, Орос хэл"
    },
    {
      "s_name": "САНХҮҮ ЭДИЙН ЗАСГИЙН СУРГУУЛЬ",
      "h_name": "Худалдаа",
      "m_name": "Олон улсын худалдаа эдийн засаг",
      "bosgo_onoo": 480,
      "MergejilId": 23,
      "mergeshil": "Элчин сайдын яамны худалдааны атташе, олон улсын байгууллагын худалдааны ажилтан, дэлгүүр худалдааны байгууллагуудын худалдааны мэргэжилтэн гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Газарзүй, Биологи, Монголын түүх",
      "shalgalt_1": "Математик, Нийгмийн тухай мэдлэг, Физик, Англи хэл, Орос хэл"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Эрх зүй",
      "m_name": "Олон улсын эрх зүй",
      "bosgo_onoo": 480,
      "MergejilId": 24,
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Хими, Биологи, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Нийгмийн тухай мэдлэг, Монгол хэл, Математик, Физик, Англи хэл, Орос хэл"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Аюулгүй байдал-хууль сахиулах",
      "m_name": "Аюулгүй байдал-хууль сахиулах",
      "bosgo_onoo": 480,
      "MergejilId": 25,
      "mergeshil": "Цагдаагийн байгууллага, ШШГЕГ, ОБЕГ, Төрийн тусгай хамгаалалтын газар, Хилийн алба, Нисэх гаалийн шалган, нэвтрүүлэх алба, ААНБ-д аюулгүй байдлын ажилтан гэх мэт",
      "shalgalt_2": "Ур чадвар",
      "shalgalt_1": "Нийгмийн тухай мэдлэг, Монгол хэл, Математик, Англи хэл, Орос хэл"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Олон улсын харилцаа",
      "m_name": "Гадаад харилцааны ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 26,
      "mergeshil": "Дипломатч, элчин сайдын яамны ажилтан, олон улсын байгууллагын ажилтан, төрийн болон төрийн бус байгууллагын гадаад харилцааны салбар хэлтэст мэргэжилтэн, ахлах, дарга, зөвлөх, олон улсын харилцааны багш, гадаад улс оронтой хамтын ажиллагаатай хувийн пүүс, компанид гадаад харилцааны ажилтан, менежер, ахлагч, зөвлөх дарга",
      "shalgalt_2": "Физик, Хими, Биологи, Математик, Монгол хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Нийгмийн тухай мэдлэг, Монгол хэл, Математик, Англи хэл, Орос хэл"
    },
    {
      "s_name": "ЧИНГИС СООСЭ ОЛОН УЛСЫН ХАРИЛЦАА",
      "h_name": "Эрх зүй /Их Засаг Хууль зүйн сургуулийн салбар/",
      "m_name": "Эрх зүй /Их Засаг Хууль зүйн сургуулийн салбар/",
      "bosgo_onoo": 480,
      "MergejilId": 27,
      "mergeshil": "Бүх шатны шүүхийн шүүгч, прокурор, мөрдөгч, шийдвэр гүйцэтгэгч, өмгөөлөгч, нотариатч, арбитрч, цагдаа, гааль, татвар, тагнуул, хорих, хилийн цэрэг зэрэг байгууллагын алба хаагч, төрийн захиргааны болон нутгийн өөрөө удирдах байгууллага, аж ахуйн нэгж, төрийн бус байгууллагын ажилтан, хууль зүйн, их дээд сургуулийн багш гэх мэт",
      "shalgalt_2": "Англи хэл, Орос хэл, Физик, Хими, Биологи, Математик, Монгол хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Нийгмийн тухай мэдлэг, Монгол хэл, Математик, Англи хэл, Орос хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Компьютерийн программ хангамж",
      "m_name": "Компьютерийн программ хангамж",
      "bosgo_onoo": 480,
      "MergejilId": 32,
      "mergeshil": "Программист, Харилцаа холбооны компаниудад программист, /Мобиком, Юнитель, Скайтель, Жи-мобайл, Цахилгаан холбоо/ гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Зочлох үйлчилгээ",
      "m_name": "Зочид буудал зоогийн газрын менежмент",
      "bosgo_onoo": 480,
      "MergejilId": 33,
      "mergeshil": "Зочлох үйлчилгээний байгууллагын бүх шатны менежер, дарга гэх мэт",
      "shalgalt_2": "Монгол хэл, Физик, Хими, Биологи",
      "shalgalt_1": "Математик, Физик, Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх, Ур чадвар"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Аялал жуулчлал",
      "m_name": "Аялал жуулчлалын менежмент",
      "bosgo_onoo": 480,
      "MergejilId": 34,
      "mergeshil": "Олон улсын аялал жуулчлалын байгууллагын менежер, дарга гэх мэт",
      "shalgalt_2": "Монгол хэл, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Англи хэл, Монгол хэл, Орос хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Барилгын инженер",
      "m_name": "Иргэний ба үйлдвэрийн барилгын инженер",
      "bosgo_onoo": 480,
      "MergejilId": 28,
      "mergeshil": "Барилгын үйлдвэрлэлийн салбарт барилгын инженер, барилгын захиалагч, зураг төслийн салбарт зураг төслийн инженер, эрдэм шинжилгээ, хяналтын байгууллагын ажилтан, судлаач инженер, эрдэм шинжилгээний ажилтан, барилгын компаны ерөнхий инженер, талбайн инженер гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Барилгын инженер",
      "m_name": "Авто замын барилгын инженер",
      "bosgo_onoo": 480,
      "MergejilId": 29,
      "mergeshil": "Барилгын үйлдвэрлэлийн салбарт барилгын инженер, барилгын захиалагч, зураг төслийн салбарт зураг төслийн инженер, эрдэм шинжилгээ, хяналтын байгууллагын ажилтан, судлаач инженер, эрдэм шинжилгээний ажилтан, барилгын компаны ерөнхий инженер, талбайн инженер гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Дулааны инженер",
      "m_name": "Дулааны инженер",
      "bosgo_onoo": 480,
      "MergejilId": 30,
      "mergeshil": "Дулааны тоног төхөөрөмжийн инженер, дулааны процессын автоматжуулалын инженер, халаалтын системийн инженер, цурын турбин, уурын генераторын ашиглалтын инженер, дулааны цахилгаан станцын горимын инженер, дулааны цахилгааны станцын зураг төслийн инженер, хяналтын инженер, дулааны цахилгаан станцын туршилт, тохируулгын инженер",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Монгол хэл"
    },
    {
      "s_name": "ҮНДЭСНИЙ ИНЖЕНЕР ТЕХНОЛОГИЙН СУРГУУЛЬ",
      "h_name": "Цахилгааны инженер",
      "m_name": "Цахилгааны инженер",
      "bosgo_onoo": 480,
      "MergejilId": 31,
      "mergeshil": "Эрчим хүчний үйлдвэр, албан газруудад цахилгааны инженер, ЦС, ДС-ын тоног төхөөрөмжийн угсралт суурилалтын инженер, цахилгаан эрчим хүчний байгууллагын хэмнэлтийн инженер, засвар үйлчилгээ, туршилт тохируулгын инженер, диспетчерийн үндэсний төвд диспетчер инженер, гадаад дотоодын байгууллагын төсөл хэрэгжүүлэгч байгууллагын мэргэжилтэн гэх мэт",
      "shalgalt_2": "Монгол хэл, Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Математик, Физик, Нийгмийн тухай мэдлэг, Монгол хэл"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Ерөнхий мэргэжлийн анагаах ухаан /Хүний их эмч/",
      "m_name": "Их эмч",
      "bosgo_onoo": 480,
      "MergejilId": 35,
      "mergeshil": "",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Хими, Биологи"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Уламжлалт анагаах ухаан /Уламжлалт анагаахын их эмч/",
      "m_name": "Улалмжлалтын их эмч",
      "bosgo_onoo": 480,
      "MergejilId": 36,
      "mergeshil": "",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Хими, Биологи, Биологи"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Сувилахуй",
      "m_name": "Сувилагч",
      "bosgo_onoo": 480,
      "MergejilId": 37,
      "mergeshil": "",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Хими, Биологи"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Нийгмийн эрүүл мэнд",
      "m_name": "Нийгмийн эрүүл мэнд судлаач",
      "bosgo_onoo": 480,
      "MergejilId": 38,
      "mergeshil": "",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Хими, Биологи"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Эм зүй",
      "m_name": "Эм зүйч",
      "bosgo_onoo": 480,
      "MergejilId": 39,
      "mergeshil": "",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Хими, Биологи, Хими"
    },
    {
      "s_name": "АНАГААХ УХААНЫ СУРГУУЛЬ",
      "h_name": "Шүдний их эмч",
      "m_name": "Шүд, нүүр,ам судлал",
      "bosgo_onoo": 480,
      "MergejilId": 40,
      "mergeshil": "",
      "shalgalt_2": "Монгол хэл, Математик, Физик, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Хими, Биологи, Биологи"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Сэтгүүл зүй",
      "m_name": "Сэтгүүлч",
      "bosgo_onoo": 480,
      "MergejilId": 41,
      "mergeshil": "Телевизийн сэтгүүлч, сонины сэтгүүлч, FM радиогоор сэтгүүлч, олон улсын сэтгүүлч",
      "shalgalt_2": "Ур чадвар",
      "shalgalt_1": "Монгол хэл, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Жүжиглэх урлаг",
      "m_name": "Жүжигчин",
      "bosgo_onoo": 480,
      "MergejilId": 42,
      "mergeshil": "Театрын жүжигчин, киноны жүжигчин, радио телевизийн жүжигчин",
      "shalgalt_2": "Ур чадвар",
      "shalgalt_1": "Хими, Монгол хэл, Математик, Физик, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Зураг авалт",
      "m_name": "Кино телевиз, хэвлэлийн зураг авалт /Оператор/",
      "bosgo_onoo": 480,
      "MergejilId": 44,
      "mergeshil": "Киноны зураглаач, телевизийн зураглаач, хэвлэлийн зураглаач",
      "shalgalt_2": "Ур чадвар",
      "shalgalt_1": "Хими, Монгол хэл, Математик, Физик, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Найруулах урлаг",
      "m_name": "Найруулагч",
      "bosgo_onoo": 480,
      "MergejilId": 45,
      "mergeshil": "Театрын найруулагч, киноны найруулагч, радио телевизийн найруулагч",
      "shalgalt_2": "Ур чадвар",
      "shalgalt_1": "Хими, Монгол хэл, Математик, Физик, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Багш, Сургуулийн өмнөх боловсролын",
      "m_name": "Багш, сургуулийн өмнөх боловсрол",
      "bosgo_onoo": 480,
      "MergejilId": 46,
      "mergeshil": "Сургуулийн өмнөх боловсролын багш, цэцэрлэгийн багш",
      "shalgalt_2": "Хими, Биологи, Нийгмийн тухай мэдлэг, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Монгол хэл, Нийгмийн тухай мэдлэг, Математик, Физик"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Багш, бага ангийн",
      "m_name": "Багш, бага ангийн",
      "bosgo_onoo": 480,
      "MergejilId": 47,
      "mergeshil": "Бага ангийн багш",
      "shalgalt_2": "Хими, Математик, Физик, Биологи, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Монгол хэл, Математик, Физик, Нийгмийн тухай мэдлэг"
    },
    {
      "s_name": "БОЛОВСРОЛ СОЁЛ УРЛАГИЙН СУРГУУЛЬ",
      "h_name": "Сэтгэл судлал",
      "m_name": "Сэтгэл судлал",
      "bosgo_onoo": 480,
      "MergejilId": 48,
      "mergeshil": "Сэтгэл судлал",
      "shalgalt_2": "Хими, Математик, Физик, Биологи, Англи хэл, Орос хэл, Газарзүй, Монголын түүх",
      "shalgalt_1": "Монгол хэл, Нийгмийн тухай мэдлэг, Математик, Физик"
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Онгоцны үйлчлэгч",
      "bosgo_onoo": 480,
      "MergejilId": 49,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Англи хэл",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Онгоцны нисгэгч",
      "bosgo_onoo": 480,
      "MergejilId": 50,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Англи хэл",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Онгоцны засварын инженер",
      "bosgo_onoo": 480,
      "MergejilId": 51,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Англи хэл",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Агаарын тээвэр",
      "m_name": "Удирдлагатай онгоцны инженер",
      "bosgo_onoo": 480,
      "MergejilId": 52,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Англи хэл",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Маркетинг",
      "bosgo_onoo": 480,
      "MergejilId": 53,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Банк санхүү",
      "bosgo_onoo": 480,
      "MergejilId": 54,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Нийгмийн халамж",
      "bosgo_onoo": 480,
      "MergejilId": 55,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Хэвлэл мэдээлэл, зар суртачилгааны ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 56,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Зочид буудал зоогийн газрын үйлчилгээний ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 57,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Зочид буудал аялал жуулчлалын маркетинг",
      "bosgo_onoo": 480,
      "MergejilId": 58,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Нийгмийн шинжлэх ухаан",
      "m_name": "Тусгай хэрэгцээт боловсролын багш /бага, дунд/",
      "bosgo_onoo": 480,
      "MergejilId": 59,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Шинжлэх ухаан технологи",
      "m_name": "Агаарын IT /агаарын тээврийн IT/",
      "bosgo_onoo": 480,
      "MergejilId": 60,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг, Англи хэл",
      "shalgalt_1": null
    },
    {
      "s_name": "ЖЭСАН ЧИНГИС ХААН ГАДААД ХЭЛ СОЁЛЫН СУРГУУЛЬ",
      "h_name": "Шинжлэх ухаан технологи",
      "m_name": "Цахилгаан техник, IT",
      "bosgo_onoo": 480,
      "MergejilId": 61,
      "mergeshil": "БНСУ-ын алс дорнодын их сургуультай хамтарсан 2+2 хөтөлбөр",
      "shalgalt_2": "Монгол хэл, Математик, Нийгмийн тухай мэдлэг, Англи хэл",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Хэвлэлийн график дизайнч",
      "bosgo_onoo": 480,
      "MergejilId": 63,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Нарийн бичгийн дарга албан хэргийн ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 64,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Барилгын засал чимэглэгч",
      "bosgo_onoo": 480,
      "MergejilId": 65,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Хувцас дизайн",
      "bosgo_onoo": 480,
      "MergejilId": 66,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Үсчин",
      "bosgo_onoo": 480,
      "MergejilId": 67,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Гоо засалч",
      "bosgo_onoo": 480,
      "MergejilId": 68,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 2.5+1 жил хөтөлбөр",
      "m_name": "Зочид буудал, зоогийн газрын үйлчилгээний ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 69,
      "mergeshil": "Их Засаг МСҮТ-д 2.5 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 9-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Агаарын хөлгийн үйлчилгээний ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 70,
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Нягтлан бодох, бүртгэл тооцооны ажилтан",
      "bosgo_onoo": 480,
      "MergejilId": 71,
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Нярав төлбөр тооцооны ажилтан /цалин хөлсний /",
      "bosgo_onoo": 480,
      "MergejilId": 72,
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Үсчин",
      "bosgo_onoo": 480,
      "MergejilId": 73,
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Тогооч",
      "bosgo_onoo": 480,
      "MergejilId": 74,
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    },
    {
      "s_name": "ИХ ЗАСАГ МЭРГЭЖИЛ СУРГАЛТЫН ҮЙЛДВЭРЛЭЛИЙН ТӨВ",
      "h_name": "БНСУ-ийн Кён-Ин их сургуулийн коллежтэй хамтарсан 1+1 жил хөтөлбөр",
      "m_name": "Гоо засалч",
      "bosgo_onoo": 480,
      "MergejilId": 75,
      "mergeshil": "Их Засаг МСҮТ-д 1 жил суралцаад 1 жилийн хугацаанд БНСУ-ыг зорин суралцах боломжтой. Та сонгосон мэргэжлийн хүрээнд Кён-Ин их сургуулийн коллежийн дипломтой төгсөнө.",
      "shalgalt_2": "ЕБС-ийн 12-р анги төгсөгчид хамрагдана",
      "shalgalt_1": null
    }
  ]);

  const [key, setKey] = useState('Бакалавр')

  const [searchTerm, setSearchTerm] = useState('');

  if (key == "2+2") {
    delete location.state;
    FilteredHutulbur = hutulburs.filter(hutulbur => hutulbur.mergeshil.toLocaleLowerCase().includes(key.toLocaleLowerCase()))
  }
  if (key == "Магистр") {
    delete location.state; FilteredHutulbur = hutulburs.filter(hutulbur =>
      ["сургалт", "магистр"].some(test => hutulbur.m_name.toLocaleLowerCase().includes(test.toLowerCase())))
  }
  if (key == "Эчнээ") {
    delete location.state;
    FilteredHutulbur = hutulburs.filter(hutulbur => hutulbur.m_name.toLocaleLowerCase().includes(key.toLowerCase()))
  }
  if (key == "Бакалавр") FilteredHutulbur = hutulburs.filter(hutulbur => ["сургалт", "магистр"].some(test => !hutulbur.m_name.toLocaleLowerCase().includes(test.toLowerCase())))
  if (searchTerm) {
    delete location.state
    FilteredHutulbur = hutulburs.filter(hutulbur => hutulbur.m_name.toLocaleLowerCase().includes(searchTerm.toLocaleLowerCase()))
  }

  if (location && location.state) {
    let s = location.state.toString();
    FilteredHutulbur = hutulburs.filter(hutulburs =>
      hutulburs.s_name.toLowerCase().includes(s.toLowerCase())
    );
  }
  // toast("Wow so easy!")
  return (
    <div>
      <div className="container mb-5">
        <Tab.Container id="left-tabs-example"  >
          <Tabs
            defaultActiveKey="Бакалавр"
            id="justify-tab-example"
            className="mb-3 "
            justify
            activeKey={key}
            onSelect={(k) => setKey(k)}
          >
            <Tab eventKey="Магистр" title="Магистр" className="text-light" />
            <Tab eventKey="Бакалавр" title="Бакалавр" />
            <Tab eventKey="2+2" title="2+2" />
            <Tab eventKey="Эчнээ" title="Эчнээ" />
          </Tabs>
        </Tab.Container>
        <InputGroup className="text-center m-3">
          <FormControl
            onChange={(e) => setSearchTerm(e.target.value)}
            placeholder="Мэргэжлийн нэрээр хайх..."
            className="text-center fs-4 lead  pt-4"
            value={searchTerm}
          />

        </InputGroup>
      </div>
      {/* table */}
      <div className="container-xxl container-xl container-fluid container-lg">
        <Table striped bordered hover size="sm" responsive="xxl" variant="dark" className="pt-4" >
          <thead>
            <tr>
              {Ectx.state.burtgel_Id && Ectx.state.email &&
                (
                  <th ></th>
                )
              }
              <th className="lead fs-5 text-start ">Сургуулийн нэр</th>
              <th className="lead fs-5 text-start">Хөтөлбөрийн нэр</th>
              <th className="lead fs-5 text-start">Мэргэжил</th>
              <th className="lead fs-5 text-start">Мэргэшил</th>

              <th className="lead fs-5 text-start">Босго оноо</th>
              <th className="lead fs-5 text-start">Шалгуур 1</th>
              <th className="lead fs-5 text-start">Шалгуур 2</th>
            </tr>
          </thead>
          <tbody>

            {FilteredHutulbur.map(hutulbur => {
              return (
                <tr key={hutulbur.MergejilId}>

                  {Ectx.state.burtgel_Id && Ectx.state.email &&
                    (
                      <td className="align-middle"><button className='btn btn-primary ' onClick={() => Ectx.choose(Ectx.state.burtgel_Id, hutulbur.MergejilId)}>
                        Сонгох
                      </button>
                      </td>
                    )
                  }
                  <td className="fs-6 align-middle text-start">{hutulbur.s_name}</td>
                  <td className="fs-5 align-middle text-start">{hutulbur.h_name}</td>
                  <td className="fs-5 align-middle text-start">{hutulbur.m_name}</td>
                  <td className="fs-5 align-middle text-start">{hutulbur.mergeshil}</td>

                  <td className="fs-6 align-middle text-ce" >{hutulbur.bosgo_onoo}</td>
                  {
                    hutulbur.shalgalt_1 == null ? (<td className="text-start align-middle fs-5" colSpan={2} style={{ wordWrap: "break-all" }}> {hutulbur.shalgalt_2}</td>) : (<>
                      <td className="text-start align-middle  fs-5">{hutulbur.shalgalt_1}</td>
                      <td className="text-start fs-5 align-middle " >{hutulbur.shalgalt_2}</td></>)
                  }

                </tr>
              )
            })}

          </tbody>
        </Table>
      </div>


    </div>
  )
}

export default HutulburPage